<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Курс по ООП PHP</title>
</head>
<body>
<p>Курс по ООП PHP</p>

<p>Урок 1. Класс и объект </p>
<p>Урок 2. Свойства объекта </p>
<p>Урок 3. Методы объекта </p>
<p>Урок 4. Методы __construct и __destruct </p>
<p>Урок 5. Домашнее задание. Класс для работы с файлом </p>
<p>Урок 6. Константы класса. Статические свойства и методы </p>
<p>Урок 7. Наследование. Часть 1 </p>
<p>Урок 8. Наследование. Часть 2 </p>
<p>Урок 9. Модификаторы доступа </p>
<p>Урок 10. Абстрактные классы и интерфейсы </p>
<p>Урок 11. Интерфейсы и контроль типа </p>
<p>Урок 12. Автозагрузка и пространства имен </p>
<p>Урок 13. Composer и автозагрузка </p>
<p>Урок 14. Трейты </p>
<p>Урок 15. Позднее статическое связывание </p>
<p>Урок 16. Магические методы </p>
<p>Урок 17. Шаблоны проектирования</p>

<hr>
<p>
    Функция для удобного (красивого) вывода содержимого массива:</p>
<p>function debug($data){.....
    <!--    echo '<pre>' . print_r($data,1) . '</pre>';-->
    }</p>

</body>
</html>
